[
  "A key agenda was the restructuring of the National Youth Festival (NYF). The focus was on information dissemination mechanisms and improving outreach by on boarding Youth on the YUVA Portal. States/ UTs showcased presentations on Restructuring of National Youth Festival (NYF) on allotted themes related to Youth as Job Creators, Ek Bharat Sreshtha Bharat, Improving Millets production through Science/ Science for Society, Health and Fitness and Mission LiFE, which was followed by an Open House Discussion. Our collective goal is to shape the future of youth engagement and sports in our nation: Shri Anurag Singh Thakur  In the beginning, Secretary (Youth Affairs) welcomed all those present and highlighted the use of the YUVA Portal for anchoring the Meri Maati Mera Desh Programme in a successful manner. Visitor Counter : 228 The Ministry of Youth Affairs & Sports hosted a Review Meeting at New Delhi on 22 The States were requested to support in increasing the outreach and the effective execution of the Khelo India Scheme. ******* PPG/SK The meeting was attended by Secretary level officers from the state governments pan India.   Minister Shri Anurag Singh Thakur in his address said, “Our collective goal is to shape the future of youth engagement and sports in our nation. The role of Department of Youth Affairs is crucial to engage with the youth and create a roadmap to onboard them at different levels.” The meeting also included presentations on the importance of adventure sports for youth engagement, mental and physical development and strengthening discipline among youth. A presentation was made by the Indian Mountaineering Foundation. (Release ID: 1959771) The presentation included the Khelo India ASMITA, the marquee women’s sports leagues that are organized at zonal and national level were organized in 120 Cities in 27 States. Various initiatives carried out under the FIT India mission was a significant agenda that was deliberated on. This includes the FIT India Quiz, the biggest national level quiz on sports and fitness with participation of more than 61,000 students, FIT India School week where various activities are carried out at school-level and the FIT India mobile app and its significance. Various verticals of the Khelo India scheme were presented about. This includes establishment of Khelo India Centres at the District level with 1000 Khelo India Centres designated and the establishment of Khelo India State Centre of Excellence with significant importance given to training of past champion athletes, robust monitoring and evaluation mechanism, etc. It was followed by the sessions for development of sports where various key agendas were discussed where the States have a vital role to play. One of the key topics that were deliberated on is the the development of sports infrastructure in the States under the Khelo India Scheme, their progress and geotagging of all sports infrastructure in the state under the PM Gati Shakti Mission through a dedicated mobile application. September, 2023 under the chairpersonship of the Union Minister for Youth Affairs & Sports Shri Anurag Singh Thakur. The Meeting further discussed the potential use of the YUVA Portal for engaging Youth. The platform has already registered an impressive 11.70 lakh youth, on boarded 921 businesses, and established 7269 Youth Clubs. An insightful presentation on Experiential Learning Program for youth in Business and Police Department was made by the Department of Youth Affairs. Many state governments said they would be happy to onboard Youth for the experiential learning programme since it would improve youth employability.",
  " Visitor Counter : 300 (Release ID: 1959769) The International Monetary Fund (IMF) presented a comprehensive overview of India's remarkable journey in developing the India Stack as a world-class Digital Public Infrastructure which has not only transformed the digital landscape in India but also offers powerful lessons for digital transformation worldwide. The IMF's Paper “Stacking up the Benefits: Lessons from India’s Digital Journey” particularly commended India's Direct Benefit Transfer mechanism for effectively reaching over 87% of poor households during the COVID-19 pandemic, highlighting India's ability to deliver essential services through digital means. The Department of Economic Affairs, Ministry of Finance, Government of India, in collaboration with the International Monetary Fund (IMF) Asia and Pacific Department (APD), with support from the IMF South Asia Regional Training and Technical Assistance Centre (SARTTAC) hosted the International Seminar on Digital Public Infrastructure (DPI): Enabler for Financial Inclusion & Productivity Gains in New Delhi today. The hybrid event saw addresses from Secretary (Economic Affairs), Ministry of Finance, Government of India; Chief Economic Advisor, Government of India; senior experts from the IMF and World Bank joining in-person and representatives from over 100 countries across Asia, Africa, and the Middle East joining virtually. This seminar served as a platform for fostering peer learning, sharing global best practices, and promoting collaboration to harness the potential of Digital Public Infrastructure in advancing financial inclusion and productivity. The Seminar showcased India's leadership in the field of Digital Public Infrastructure (DPI) and its commitment to fostering inclusive economic growth NB/VM/KMN The International Seminar on Digital Public Infrastructure showcased India's leadership in the field of digital public infrastructure and its commitment to fostering inclusive economic growth. The event served as a platform for international collaboration and knowledge sharing, furthering the global agenda of harnessing DPIs for sustainable development. **** World Bank presented the G20 Policy Recommendations for Advancing Financial Inclusion & Productivity Gains through Digital Public Infrastructure in the Seminar. These recommendations were recently endorsed by the G20 Leaders’ Summit in New Delhi. These recommendations provide actionable insights and customizable strategies for countries to optimize the potential of DPIs in achieving financial inclusion and fostering economic growth. The seminar also witnessed discussions between industry experts, Mr. Nithin Kamath, Chief Executive Officer, Zerodha and Dr. Pramod Varma, Chief Technology Officer, EkStep Foundation. Their insights shed light on the path to innovation, competition, and financial inclusion through the adoption of DPIs. Secretary (Economic Affairs) shared insights from India’s digital journey and underscored the critical role of Digital Public Infrastructure in bridging the digital and financial inclusion divides as simple, scalable, and sustainable solutions that can effectively reach the last mile, ensuring that no one is left behind in the digital age. Chief Economic Advisor discussed the way ahead for developing DPI through Knowledge Sharing, Capacity Building and Cross-Border Linkage of DPIs.",
  " Referring to the elaborate planning and execution process, the Prime Minister asked the functionaries to document their experiences and the learnings. The document, thus prepared, can prepare useful guidelines for future events, he said. The Prime Minister highlighted the importance of such successful organizations from the human resource and learning point of view and said when an event takes place properly rather than just happening, it leaves a far-reaching impact. He explained this by giving an example of Commonwealth Games which could have been a great opportunity for branding the country but it not only defamed the people involved and the country but also infused a sense of despondency in the governing system. On the other hand, the cumulative effect of G20 has been that of success in showcasing the strength of the country to the world. “I am not concerned with the praise in editorials but for me, real happiness lies in the fact that my country is now confident that it can host any such event in the best possible way”, he said. *** Speaking on the occasion, the Prime Minister underlined the accolades that are being showered for the successful organization of G20 and credited the ground level functionaries for this success. The Prime Minister, Shri Narendra Modi interacted with Team G20 at Bharat Mandapam today. The Prime Minister also addressed the gathering on the occasion. The Prime Minister underlined the need for global exposure in order to improve further. He said now global approach and context should underline all our work. He said during the G20 one lakh key decision-makers visited India and they have gone back as tourism ambassadors of India.   He said that the seed of this ambassadorship was planted by the good work of the ground level functionaries. He said this is a time to take tourism to new heights. “Today’s event is about the unity of labourers (Mazdoor Ekta) and both you and I are Mazdoor”“Working collectively in the field removes silos and creates a team”“There is strength in the collective spirit”“A well organized event has far-reaching benefits. CWG infused a sense of despondency in the system while G20 made the country confident of big things”“For the welfare of humanity India is standing strong and reaches everywhere in times of need” He said in this event,  the Ministers and the senior officers are sitting on back seats and ground level functionaries are in the forefront. “I like this arrangement as it assures me that my foundation is strong”, he said. He further elaborated on this growing confidence by citing India’s great contribution in rescue during calamities at a global level like, earthquake in Nepal, cyclone in Fiji, Sri Lanka where material was sent, Maldives  electricity and water crisis, evacuation from Yemen, Turkey earthquake. All this, he said, established that for the welfare of humanity, India is standing strong and reaches everywhere in times of need.  He also informed about the preparations for rescue work for Jordan calamity even during the middle of the G20 summit, though the need for going did not arise. The Prime Minister said that in routine office work we  do not come to know the capabilities of our colleagues. While working collectively in the field removes silos, vertical and horizontal silos and creates a team. He elaborated this point with the example of the ongoing Swachta Abhiyan and asked to make that a collective effort in the departments. This will make the project a festival instead of a chore, he said. There is strength in the collective spirit, he added. The Prime Minister said that it is the sense of the importance of enterprise and a feeling of being a central part of that enterprise in everyone is the secret of the success of such big events. DS The Prime Minister asked the functionaries to sit informally and share experiences in their respective departments. This, he said, puts one’s performance in a broader perspective. He said that once we know the efforts of others that pushes us to do better. He said that ‘today’s event is the unity of labourers and both you and I are Mazdoor’. The interaction saw participation of around 3000 people, who have contributed to the success of G20 Summit. It especially included those who have worked at the ground level to ensure smooth conduct of the Summit, including functionaries like cleaners, drivers, waiters and other staff from across various Ministries. The interaction was also attended by Ministers and officials of various departments. Visitor Counter : 528 He asked for coming out of hierarchies in offices and for making an effort to know the strengths of one’s colleagues. The Prime Minister interacted with the functionaries and listened to their experiences. (Release ID: 1959762)",
  " With the signing of this MoU, Department of Social Justice &Empowerment feels that implementation of NMBA will get a boost towards achieving the objective of drug sensitized India. Shri Saurabh Garg, Secretary for the Department of Social Justice & Empowerment attended and addressed the event. NMBA is playing a crucial role to overcome from this addiction. Till now Nasha Mukt Bharat Abhiyaan (NMBA) through the various activities undertaken on-ground 11+ crore people reached out so far. 8,000 Master Volunteers have been selected and trained to lead the Abhiyaan activities in the identiﬁed districts. More than 3.36+ crore youth have actively participated in the activities of the Abhiyaan and spreading on-ground the message against substance abuse. The contribution of 2.24+ Crore women have also been vital in reaching out to a larger community through the Anganwadi & ASHA Workers, ANMs, Mahila Mandals & Women SHGs. Minister of Social Justice & Empowerment (HMSJE) talked about the efforts undertaken through the Nasha Mukt Bharat Abhiyaan in the country that have helped make this Abhiyaan a mass movement. The Minister informed the gathering about the special events like National Pledge Against Drug Abuse, NCC Interaction with the presence of Raksha Mantri that are regularly conducted to involve stakeholders in the campaign against drug use. Stressing the importance of participation of spiritual organizations in this Abhiyaan, the Minister expressed his faith that this collaboration with the Gayatri Pariwar will go a long way to illuminate the lives of individuals and restrict them from moving towards the path of addiction and help in making a mentally, emotionally and physically strong society. ******* MG/P/PD Since 2020, the Ministry is implementing the ambitious Nasha Mukt Bharat Abhiyaan (NMBA) in all districts of the country with an aim to create awareness about ill effects of substance abuse among the youth, with special focus on higher education institutes, university campuses, schools and reaching out into the community and garnering community involvement and ownership of the Abhiyaan. A special initiative under the NMBA is association of religious/ spiritual organizations for carrying out various activities under NMBA and to spread the message of NMBA under their banner. Taking a step in this direction, Department of Social Justice & Empowerment has signed an MoU with the All World Gayatri Pariwar for spreading the message of NMBA among the youth, women, students and the community. The MoU signing ceremony was held in Dr. Ambedkar International Centre, 15 Janpath, New Delhi on 22ndSeptember, 2023 at 09:00 am in the presence of Dr. Virendra Kumar, HMSJE, Dr. Chinmay Pandya, All World Gayatri Pariwar, Senior oﬃcers of the Department and more than 500 members of All World Gayatri Pariwar. Dr. Chinmay Pandya, All World Gayatri Praiwar congratulated the Ministry of Social Justice and Empowerment for launching such a mass campaign against drugs. Through his experiences of working in this area, he stressed on the importance of a conducive familial and social environment that would help prevent as well as overcome substance use. Through the 5000 centers and 16+ Crore people connected with the All World Gayatri Pariwar, Dr. Pandya affirmed the participation in the Nasha Mukt Bharat Abhiyaan and contributing towards a Nasha Mukt Bharat. As per report of ﬁrst comprehensive National Survey on Extent and Pattern of Substance Use in India conducted by Department of Social Justice & Empowerment through National Drug Dependence Treatment Centre (NDDTC), AIIMS, New Delhi, Alcohol is the most common psychoactive substance used by Indians followed by Cannabis and Opioids. Visitor Counter : 402 (Release ID: 1959734) Technology and Social media have been effectively utilized to spread the message of the Abhiyaan online by creating handles on Facebook, Twitter & Instagram and sharing daily updates on them. An Android based mobile Application has been developed to capture the data of activities happening on ground on a real-time basis by the districts and master volunteers. This App has been placed on the Google Play Store. All the de-addiction facilities have been geo-tagged for ease of access by the public. To curb the menace of drug demand, the Ministry of Social Justice and Empowerment (MoSJ&E), Government of India has been implementing National Action Plan for Drug Demand Reduction (NAPDDR), an umbrella scheme under which ﬁnancial assistance is provided to State Governments/ Union Territories (UT) Administrations for Preventive Education and Awareness Generation, Capacity Building, Skill development, vocational training and livelihood support of ex-drug addicts etc. Substance use disorder is an issue which has the potential to adversely affect the social fabric of the country. Dependence to any substance not only affects the individual’s health, but also disrupts their families and the whole society. Regular consumption of various psychoactive substances leads to dependence of the individual.",
  " PG receipts and disposal:91.40% ofPublic Grievances have been disposed of (48142 out of 52668 receipts). ***** This department will undertake an extensive Swachhta Campaign across Bharat though Central Government Pensioners’ Associations and their affiliated Association Total files weeded out: 75% of Physical files have been weeded out which were identified for weeding. No. of Cleanliness Campaign to be conducted:- 50 No. of rules identified for simplification:- 50 Reference from MPs: 100% of references received from MPs have been disposed of. Public Grievances receipts:-5000 The Department is committed to ensure Ease of Living through “Ease of Rule” and ensuring Swachhta in its premises on a continuous basis. It is gearing up to conduct Special Campaign 3.0 from 2ndOctober to 31stOctober, 2023 to further minimize pendency, institutionalize Swachhta, strengthen internal monitoring mechanisms and improve records management.The department has identified targets of Special Campaign for Disposal of Pending Matters 3.0 (SCDPM 3.0):- As part of the Special Campaign for Disposal of Pending Matters 2.0 (SCDPM 2.0), the Department of Pension and Pensioners' Welfare have taken various steps to ensure Ease of Living for Pensioners during the period December 2022 to August 2023 as follows: Electronic files for review:- 883 Physical files for review:- 1358 SNC/PK Visitor Counter : 252 (Release ID: 1959729) Special focus on “Ease of Rules” for  enhancing \"Ease of Living\" for Pensioners. Under “Ease of Rule” category, Department of Pension and Pensioners' Welfare issued 62 OMs for Ease of Living of pensioners. Cleanliness campaign was conducted at 27 sites during the period. Parliamentary Assurance: 100% of Parliamentary Assurances have been disposed of. Central Government Pensioners’ Associations have participated in this campaign all over the Country.",
  " Chief Minister of Arunachal Pradesh, Shri Pema Khandu called on the Prime Minister, Shri Narendra Modi today. “Chief Minister of Arunachal Pradesh, Shri @PemaKhanduBJP, met Prime Minister @narendramodi.” ****** Visitor Counter : 462 The Prime Minister’s Office posted on X; (Release ID: 1959727) DS/ST",
  " The Centre conducted 6th Indian Sign Language Competition, 2023 – a national-level competition held for students with hearing disabilities. The students have showcased their creativity and knowledge by participating in the competition. All the winners of the 6th ISL competition will be distributed trophy and certificate during the Sign Language Day 2023 programme. (Release ID: 1959726) Visitor Counter : 606 Indian Sign Language Research and Training Centre (ISLRTC), New Delhi under the aegis of DEPwD (Divyangjan), Ministry of Social Justice and Empowerment, Govt. of India will be celebrating Sign Language Day-2023 on 23rd September 2023 at Bhim Hall, Dr.Ambedkar International Centre Janpath, New Delhi. Launch of 267 signs of financial terms in Indian Sign Language which are jointly developed by ISLRTC, Society General and V-Shesh. The sign for financial terms are developed to facilitate communication between deaf and hearing people working in the financial and banking sector. The project will help improve the employment prospects of deaf job-seeking youth. MG/P/VL During the programme, the following programs and materials will be launched: Launch of about 10,000 ISL dictionary terms on website, launch of ISL course in Special Schools for hearing impaired launch of Video Relay Service for the deaf community through whatsapp video call. Video Relay Service is a video telecommunication service which enables deaf people to communicate with hearing people vide a remote sign language interpreter linked through video communication. The service can be broadly used in hospitals, government offices, educational institutions, bank, work place, interviews, police station and court etc. The service is provided at free of cost through whatsapp no. 8929667579. Launch of Basic Communication Skills in Indian Sign Language an online self learning course. The primary aim of this course is to foster basic communication skills in Indian Sign Language. It is tailor-made for parents of deaf children, siblings, educators, and individuals interested in acquiring basic knowledge of Indian Sign Language (ISL).The course comprises 10 modules, covering 30 essential topics, ensuring a comprehensive grasp of basic ISL communication. The theme of this year Sign Language Day-2023 is “A World Where Deaf People Everywhere Can Sign Anywhere!”A world where deaf people are seen as a part of the natural range of human diversity, and national sign languages are celebrated and used everywhere as part of national societies. On this day, collective efforts of deaf communities, governments, and civil society representatives are made to ensure their children and youth know their national sign languages, as a step towards building societies in which deaf people everywhere can sign anywhere. Ever since the United Nations declared 23rdSeptember as the International Day of Sign Languages, the ISLRTC celebrates it every year on 23rd September. DEPwD and ISLRTC are making all the possible efforts to bring more citizens, stakeholders, service-providing agencies, Deaf schools, NGOs, activists, Deaf leaders, educators, researchers etc. together into the fold of Sign Language Day in order to create positive awareness about Indian Sign Language among all sections of our society. The Day also reminds us of the need and importance of preserving sign languages as a part of linguistic and cultural diversity. All theprofessionals, parents of Deaf, Deaf students and institutions working in the field of Indian Sign Language from all walks of life are important target groups to rope into the Sign Language Day celebration. Minister of State for Social Justice & Empowerment, Km. Pratima Bhoumik will be the Chief Guest and Sh. Rajesh Aggrawal, Secretary; DEPwD will be the Guest of Honour. Rajesh Yadav, Joint Secretary, DEPwD and Sh. Mrityunjay Jha, Director, DEPwD &ISLRTC, and Representatives from National Association of Deaf, All India Federation of Deaf, and All India Federation of Deaf for Women will also grace the occasion. ***",
  " Visitor Counter : 478 ****** SK/SS/SM Artificial reef structures restrict bottom trawling in the near shore areas thus helping the marine environment to regenerate and small-scale fishers get higher catch (Release ID: 1959725) To promote sustainable practices, Department of Fisheries has sanctioned 732 artificial reef units for 10 coastal states with a total investment of Rs 126 crore as a sub-activity under “Integrated Modern Coastal Fishing Villages” of the Centrally Sponsored Scheme (CSS) of Pradhan Mantri Matsya Sampada Yojana (PMMSY). The projects are being implemented with the technical support of Fishery Survey of India (FSI) and ICAR-Central Marine Fisheries Research Institute (CMFRI). All the states have completed their site selection process while states of Kerala and Maharashtra have completed the tendering process for execution of work. Thus all projects are expected to be completed by January 2024. One artificial reef of 300m3 is expected to support 25-30 non-mechanized boats (CMFRI). As one of the impactful strategies, installation of artificial reefs in coastal waters and undertaking sea ranching programs across in all coastal states is expected to rejuvenate of coastal fisheries and re-build fish stocks. Providea firm substrate for marine life such as corals, algae and plankton to attach to and grow They provide favorable conditions for sea ranching and serve as  spawning and nursery grounds for fish. DoF has sanctioned 732 artificial reef units for 10 coastal states with a total investment of Rs 126 crore Similar to natural reefs, ARs used for aggregating fish and provide a home for fish to live and grow, reduce wave damage on coasts, helps regeneration of marine ecosystem and act as a carbon sink. As per CMFRI, two to three-fold increase in catch rates and efficiency can be realized Thus saving fuel and energy costs leading to increased income. PMMSY was launched in May 2020 with the highest ever investment of Rs. 20,050 crore to bring about Blue Revolution through sustainable and responsible development of the fisheries sector. Over the years, increased fishing activities has reduced per capita yield from coastal fisheries, to led to heavy fishing pressure, loss of fishing grounds due to bottom trawling, coastal development etc. This has also resulted in reduced income and forcing the fishers to go to deeper waters. Artificial reefs are engineering technology interventions used to rehabilitate and/or improve natural habitats, increase productivity and manage aquatic resources including habitat enhancement (FAO, 2015). Installation of artificial reefs is advantageous in many forms as below: Enhance recreational fisheries, snorkeling, eco-tourism, creating suitable areas for diving and reducing conflicts.",
  " Prime Minister, Shri Narendra Modi The Union Minister of Ports, Shipping & Waterways and Ayush, Shri Sarbananda Sonowal is going to inaugurate India’s First Lighthouse Festival from the Fort Aguada Lighthouse in Panjim, Goa tomorrow. The three days festival, beginning 23rd September and ending on 25th September, will be celebrated across all the lighthouses in the country in an effort to transform these historic spots as tourist destinations. The inaugural session will also be attended by the Chief Minister of Goa, Pramod Sawant, the Minister of State for Ports, Shipping & Waterways and Tourism, Shri Shripad Naik as well as Tourism Minister of Goa, Shri Rohan Khaunte among others. to transform India ’ Visitor Counter : 571 India’s first ever Lighthouse Festival will be held at the historic Fort Aguada in Goa from 23rd-25thSeptember, 2023. This would be a three day gala event in carnival style with local artists, dance troupes, food and culinary stalls, music concerts and similar activities to attract common people to Lighthouses. The festival also witness historians, archaeologist, cultural anthropologist and many other people with interest in history, culture and society participate in intriguing discussions around our marine history during this event. Speaking on the occasion, the Minister said, “It is a moment of great happiness for everyone  in the team at the Ministry of Ports, Shipping & Waterways as we begin this historic Lighthouse festival across the country from tomorrow. Under the visionary leadership of Prime Minister, Shri Narendra Modi ji, we remain committed to the cause of nation building. Lighthouses, that were long ignored from any potential value creation beyond their role as navigational tool, were identified by Prime Minister Narendra Modiji to be developed into a touristic point of view and allow them to become lynchpin of local tourism and, at the same time, generate income for the country. Modi ji shared this vision with all of us during the 75th episode of Mann Ki Baat and we are happy that this wonderful idea has now become a reality. While ships continue to be guided for safe sailing by these lighthouses, they will now offer their solace to people to relish the magnificent beauty of nature.” re MJPS/NSK , earlier launched a campaign ‘Lighthouse Heritage Tourism’ to transform 75 historic lighthouses into Tourism Spots. The historic lighthouses a (Release ID: 1959723) Shri Sarbananda Sonowal and Chief Minister of Goa Shri Pramod Sawant to inaugurate the historic festival at Fort Aguada Lighthouse **** s distinctive lighthouses into captivating tourism sites. The initiative aims to showcase the rich culture, significance, and allure of these magnificent structures whereby they can propel prospect of tourism and power local economy. being renovated with adequate facilities to act as tourist spots. The festival is logical outcome of this campaign by the Ministry of Ports, Shipping & Waterways (MoPSW) to transform 75 historic lighthouses across India into tourism spots. This is in line with the visionary approach of the Shri Sonowal Shri Sonowal, earlier launched a campaign ‘Lighthouse Heritage Tourism’ to transform 75 historic lighthouses into Tourism Spots. The historic lighthouses arebeing renovated with adequate facilities to act as tourist spots. The festival is logical outcome of this campaign by the Ministry of Ports, Shipping & Waterways (MoPSW) to transform 75 historic lighthouses across India into tourism spots. This is in line with the visionary approach of thePrime Minister, Shri Narendra Modito transform India’s distinctive lighthouses into captivating tourism sites. The initiative aims to showcase the rich culture, significance, and allure of these magnificent structures whereby they can propel prospect of tourism and power local economy.",
  " The trilateral exercise provided an opportunity for the three maritime nations to strengthen their partnership and improve their collective capability to support a stable, peaceful and secure Indo-Pacific region. The exercise also provided the opportunity for the participating navies to benefit from each other's experience and expertise. Complex tactical and manoeuvring exercises, cross-deck visits and cross-deck landings of integral helicopters were conducted for training of crew and enhancement of interoperability. Indian Navy's indigenously built warship INS Sahyadri, mission deployed in Indo-Pacific, participated in themaiden trilateral Maritime Partnership Exercisewith the ships and aircraft from the Royal Australian Navy (RAN) and Indonesian Navy from 20 - 21 Sep 2023. ******* VM/JSN (Release ID: 1959717) INS Sahyadri, the third ship of the indigenously designed and built Project-17 class multirole stealth frigates was built at Mazagon Dock Ltd, Mumbai and is commanded by Capt Rajan Kapoor. Visitor Counter : 622",
  " During the ongoing Swachhata Pakhwada, the Digboi Municipal Board, in collaboration with the Indian Oil Corporation Limited, orchestrated a remarkable celebration of Plastic Free Ganesh Puja from the 19th to the 21st of September in 2023. This event, held at the enchanting location of Dacca Line, Towards IOC Road, captured the essence of Assamese culture while emphasizing swachhata.In their quest to avoid plastic from the festivities, the organizers opted fora sustainable and native resource, bamboo. At this event, bamboo took center stage in the crafting of idols, the construction of the entrance gate, and the elaborate traditional decorations, such as the iconic Japi headgear and Khorahi baskets. This ingenious use of bamboo not only showcased the versatility of this material but also embodied the spirit of sustainability. ***** The celebration of Plastic Free Ganesh Puja in Digboi not only reaffirmed the town's cultural heritage but also set a shining example of responsible event management. It demonstrated that devotion to tradition and devotion to swachhatacould harmoniously coexist. As the event concluded, the joyous faces of the participants and the pristine surroundings left a lasting impression, inspiring communities far and wide to embrace the beauty of sustainable celebrations. Across the nation, the fervour of Swachhata Pakhwada has captivated every citizen and so far over 2 crore citizens have already joined the swachhata movement. To reinforce the commitment to cleanliness and waste management, segregated dustbins were thoughtfully placed throughout the mandap campus. These bins facilitated the proper disposal of waste and emphasized the importance of responsible waste management. Perhaps one of the most impactful changes was the outright prohibition of single-use plastic by all participants and the event's organizing committee. This bold step underscored the collective determination to create a truly plastic-free celebration. RKJ/M Around 200 people came to the event every day, culminating in a collective participation of 600 individuals over the three-day extravaganza. The main goal of the event was to create a celebration that made people feel good spiritually and also encouraged them to adopt swachhata. Celebrates Ganesh Puja with pandals crafted from bamboo (Release ID: 1959714) Ganesh Puja stands as a cherished celebration in India, representing more than just religious devotion. Beyond the spiritual fervor, Ganesh Puja has become a symbol of sustainable festivities, emphasizing the need for eco-friendly practices. To steer away from the environmental impact of plastic in these celebrations, many States are now embracing sustainable solutions. In alignment with this eco-conscious approach, Assam has chosen to celebrate Ganesh Puja with pandals crafted from bamboo, showcasing a commitment to both tradition and environmental responsibility. One of the most striking changes was the replacement of plastic garlands with traditional Assamese cloth, known as 'Gamocha.' These vibrant cloth adornments not only added a touch of authenticity but also symbolized a shift towards sustainable clothing. The pandal coverings, too, were transformed with cloth, and natural flowers replaced their plastic counterparts, infusing the venue with an enchanting aroma. Visitor Counter : 479",
  "It is a delight to see young kids take centre stage and assume a leadership role. Sunidhi Jangid in Rajasthan’s Kekdi Nagar Parishad is one such young leader and Swachhata Ambassador whose efforts for the local swacchata movement have attracted everyone’s attention. She has led by example and spread awareness among masses to galvanize her peers as well as elders to join the campaign.13-year-old Sunidhi Jangid is a Class 8 student in Kekdi town. She has been carrying out information, education and communication activities among her fellow students to sow the seeds of sanitation into her peers’ hearts and minds at an early age.Playing her part as a Swachh Bharat Ambassador since the Swacchotsav in March 2023, Sunidhi has educated people about sustainable ways of management of used sanitary pads, thus breaking social barriers. Visitor Counter : 398 Creating a safe and secure environment for its future generations is a fundamental requirement that every nation should strive to fulfil. The Swachh Bharat Mission is one such initiative which is designed to create a safe, hygienic, clean and garbage free India for the upcoming generations to thrive and prosper in. After Prime Minister Narendra Modi’s clarion call for a clean India, citizens from all spheres of life have joined and are driving the swachhata movement.  Sunidhi communicated her ideas and thoughts to local residents and students at the Indian Swachhata League 2.0 under the Swacchata Pakhwada- Swachhata Hi Seva campaign on 17thSeptember 2023. Over 500 people participated in various activities held under ISL 2.0 and the event was presided over by Kekdi Municipal Council head MrKamlesh Kumar Sahu. Sunidhi was so confident about her mission for swachhata that she addressed such a large gathering and was so articulate while educating the crowd about best practices for sanitation including door-to-door collection of waste, making compost from wet waste, boycotting single-use plastic, used sanitary pad management, source segregation of waste among others. In the end, Sunidhi recited a song ‘Mhane Saaf Safai Pyari Lage’ (We love cleanliness) written by her with the lyrics defining what Swachhatais all about and how much it matters to all of us. Young guns like Sunidhi are the flag-bearers of change and will go a long way in making India garbage-free. Educates people about sustainable ways of management of used sanitary pads RKJ/M (Release ID: 1959712) ***"
]
